#[2018/09/22] 変数の宿題
#1. first_name変数に自分の名前を代入してください
#2. last_name変数に自分の苗字を代入してください
#3. age変数に自分の年齢を代入してください
#4. over_好きな数字の変数を作り、自分の年齢がその数字より上ならTrueを、下ならFalseを代入してください
#5. 所持金変数を作り好きな金額を代入してください
#6. 賭け金を聞いて入力を受け付ける変数を作ってください
#7. ユーザーが入力した数値を所持金から引いた数を"残金: 数字"と出力してください
print('####################################')
#1
first_name = 'kazui'
print(first_name)
#2
last_name = 'sera'
print(last_name)
#3
age = 43
print(age)
#4
over_4 = False
print(over_4)
#5
money = 4300
print('所持金：', money)
#6
bit = int(input('掛け金を入力してください'))
print('掛け金:', bit)
#7
money -= bit
print('所持金：', money)





#[2018/09/23] リストの宿題
#1. 以下の条件にあうリストを作れ
#   ・友達を最低5人含めたfriendsリスト
#   ・果物を列挙したfruitsリスト。そのうち３つは必ず重複すること。重複の数は任せる
#   ・好きなゲームを列挙したgamesリスト
#   ・なんでも入れられる空のanythingリスト
#2. friendsリストの2番目の要素を表示しろ
#3. fruitsリストの5番目の要素を表示しろ
#4. gamesリストのindex番号6を表示しろ
#5. 上記2~4で表示した要素をanythingリストに追加してanythingリストを表示しろc
#6. +=の追加方法を使って、好きな名前をひらがな1文字ずつ格納しているリストを作れ
#7. fruitsリストの重複している要素が何個重複しているかを表示しろ
#8. friendsリストの要素数を表示しろ
#9. friendsリストのインデックス5番の要素を別の要素に上書きしろ
#10.pop()を使って好きなリストの好きな要素を削除し、削除した後のリストを表示しろ
#11.remove()を使って好きなリストの好きな要素を削除し、削除した後のリストを表示しろ
#12. delを使って4つのリスト全てを空にしろ
print('####################################')